# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license
# C3_Parc_Faster,C2f_Faster,C2f_ODConv,C3_Parc_ODConv,C2f_DBB,C3_Parc_DBB,VoVGSCSP,C2f_SCConv,C3_Parc_SCConv,C3_Parc_ScConv,C2f_ScConv,C3_Parc_EMSC,C3_Parc_EMSCP,C2f_EMSC,C2f_EMSCP,C2f_KW,C3_Parc_KW,C3_Parc_DySnakeConv,C2f_DySnakeConv,C2f_DCNv2,C3_Parc_DCNv2,C2f_OREPA,C3_Parc_OREPA,C3_Parc_REPVGGOREPA,C2f_REPVGGOREPA,C3_Parc_ContextGuided,C2f_ContextGuided,C2f_MSBlock,C3_Parc_MSBlock,C3_Parc_DLKA,C2f_DLKA,C3_Parc_Parc, C2f_Parc,C3_Parc_DWR,C2f_DWR,C3_Parc_RFCBAMConv,C3_Parc_RFCAConv,C2f_RFCBAMConv,C2f_RFCAConv,C3_Parc_AKConv,C2f_AKConv
# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.5 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3_Parc, [128, [160, 160], True]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3_Parc, [256, [80, 80], True]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, C3_Parc, [512, [40, 40], True]],
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, C3_Parc, [1024, [20, 20], True]],
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C2f_Parc, [512, [40, 40]]], # 13

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3_Parc, [256, [80, 80]]], # 17 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 14], 1, Concat, [1]], # cat head P4
    [-1, 3, C3_Parc, [512, [40, 40]]], # 20 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 10], 1, Concat, [1]], # cat head P5
    [-1, 3, C3_Parc, [1024, [20, 20]]], # 23 (P5/32-large)

    [[17, 20, 23], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
