# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license
# YOLOv5s_goldyolo summary: 281 layers, 10999837 parameters, 10750717 gradients, 22.6 GFLOPs
# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.5 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# YOLOv5 v6.0 head
head: [
    [[2, 4, 6, 9], 1, SimFusion_4in, []], # 10
    [-1, 1, IFM, [[64, 32]]], # 11
   
    [9, 1, Conv, [512, 1, 1]], # 12
    [[4, 6, -1], 1, SimFusion_3in, [512]], # 13
    [[-1, 11], 1, InjectionMultiSum_Auto_pool, [512, [64, 32], 0]], # 14
    [-1, 3, C2f, [512]], # 15

    [6, 1, Conv, [256, 1, 1]], # 16
    [[2, 4, -1], 1, SimFusion_3in, [256]], # 17
    [[-1, 11], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 1]], # 18
    [-1, 3, C2f, [256]], # 19

    [[19, 15, 9], 1, PyramidPoolAgg, [352, 2]], # 20
    [-1, 1, TopBasicLayer, [352, [64, 128]]], # 21

    [[19, 16], 1, AdvPoolFusion, []], # 22
    [[-1, 21], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]], # 23
    [-1, 3, C2f, [256]], # 24

    [[-1, 12], 1, AdvPoolFusion, []], # 25
    [[-1, 21], 1, InjectionMultiSum_Auto_pool, [512, [64, 128], 1]], # 26
    [-1, 3, C2f, [1024]], # 27

    [[19, 24, 27], 1, Detect, [nc,anchors]], # 28
  ]
