# parameters
nc: 80  # number of classes
depth_multiple: 0.75  # model depth multiple
width_multiple: 1  # layer channel multiple
anchors: 3
# anchors
# anchors:
#   - [10, 13, 16, 30, 33, 23] # P3/8
#   - [30, 61, 62, 45, 59, 119] # P4/16
#   - [116, 90, 156, 198, 373, 326] # P5/32
# ESNet
backbone:
  # [from, number, module, args]
  [ [-1, 1, conv_bn_act, [16, 3, 2]],    # 0-P2/4
    [-1, 1, DPBlock, [32, 3, 1]], # 1-P3/8
    [-1, 1, DPBlock, [64, 3, 2]],
    [-1, 1, DPBlock, [64, 3, 1]], #3
    [-1, 1, DPBlock, [128, 3, 2]],
    [-1, 1, DPBlock, [128, 3, 1]], # 5
    [-1, 1, DPBlock, [256, 3, 2]],
    [-1, 5, DPBlock, [256, 5, 1]], # 7
    [-1, 1, DPBlock, [512, 5, 2, True]],
    [-1, 1, DPBlock, [512, 5, 1, True]], # 9
  ]

#  CSP-PAN
head:
  [ [5, 1, conv_bn_act, [128, 1, 1]], #  10  
    [7, 1, conv_bn_act, [128, 1, 1]], #  11
    [9, 1, conv_bn_act, [128, 1, 1]], #  12
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 11], 1, Concat, [1]],  # cat backbone P4
    [-1, 1, DPBlock, [256, 5, 1]],
    [-1, 1, DPBlock, [128, 5, 1]], # 16


    [-1, 1, nn.Upsample, [None, 2, 'nearest' ]],
    [[-1, 10], 1, Concat, [1]],  # cat backbone P4
    [-1, 1, DPBlock, [256, 5, 1]],
    [-1, 1, DPBlock, [128, 5, 1]], # 20

    [-1, 1, DPBlock, [128, 5, 2]],
    [[-1, 16], 1, Concat, [1]],
    [-1, 1, DPBlock, [256, 5,1]],  
    [-1, 1, DPBlock, [128, 5, 1]], # 24 (P4/16-small),

    [-1, 1, DPBlock, [128, 5, 2]],
    [[-1, 12], 1, Concat, [1]],
    [-1, 1, DPBlock, [256, 5, 1]],  
    [-1, 1, DPBlock, [128, 5, 1]], # 28 (P4/16-small),

    # [-1, 1, DPBlock, [128, 5, 2]],
    # [12, 1, DPBlock, [128, 5, 2]],
    # [[-1, -2 ], 1, ADD, [1]],  # 31

    [[20, 24, 28], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5, P6)
  ]